#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=5b790a5469e3cb135ed03bcf6004356b205d6f14]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 0s [id=3e9991c4fb329b23258d4bae0e853961cae423f6]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 1s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/apple-icon.png"]: Refreshing state... [id=c11f346f-faa2-09bf-bfb1-beacad683be4]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=89af22b2-c5d2-781f-818b-a6e3035d5e90]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv"]: Refreshing state... [id=9d2c7797-18ab-8d1c-8bd1-0c5f6a2fa9e5]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/layout"]: Refreshing state... [id=679cc3bf-2eb5-19fa-4288-05cbf77d5d9b]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/_not-found"]: Refreshing state... [id=34c96e66-d1e3-caf2-398e-d5f536851c32]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/route"]: Refreshing state... [id=c3ca0778-5f25-2bf6-d312-d0602a4e031d]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/route"]: Refreshing state... [id=d8c15149-9b2f-0e43-fb52-70d6343b5dcf]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/route"]: Refreshing state... [id=301dd035-1212-6fb8-63f5-7229d19e6451]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/sitemap.xml"]: Refreshing state... [id=134b97b9-378f-c828-81c7-db56ced60b34]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/favicon.ico"]: Refreshing state... [id=b5903b48-4711-fb3b-b0a9-a8d77015e82e]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found"]: Refreshing state... [id=c015793a-8405-a58e-c8d4-8d26fb4bb8e3]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/route"]: Refreshing state... [id=9cb2ed65-1edc-129f-c315-92db9e52aa10]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/page"]: Refreshing state... [id=2bdd2071-9e84-e201-3f0d-d2ef3f1d5f3f]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/layout"]: Refreshing state... [id=66f9d611-d066-c2ea-d6f0-e0c583ca6be0]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico"]: Refreshing state... [id=dc4dbab8-3a40-53d1-8e3a-4677284a3706]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/page"]: Refreshing state... [id=ea6b5a95-5e85-5cd4-d68e-fbfe2af5a102]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/layout"]: Refreshing state... [id=82420f34-fe13-569d-bd62-089a2263389a]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg"]: Refreshing state... [id=98a04343-0931-ce3a-6db8-e107ea4063dc]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml"]: Refreshing state... [id=151a2cc5-86bd-fb0b-e1b3-1d156158ac04]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/index"]: Refreshing state... [id=55da65c7-9525-3869-c00c-080345870d19]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/"]: Refreshing state... [id=2dc562e8-ebb8-2078-2a5f-b3258614d62e]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/page"]: Refreshing state... [id=ac1c5bba-0dc6-fb26-b3c0-026b17cf854b]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/cgv"]: Refreshing state... [id=447a9869-e324-9f23-89c1-1e518b270519]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/layout"]: Refreshing state... [id=361a1835-ef74-37d0-ca2f-1d2bb19afe73]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/icon.svg"]: Refreshing state... [id=fe5c1b44-4be9-7fa2-2401-524eb0378701]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=804a9de1-3d35-3ec4-9798-f275bce01136]
module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png"]: Refreshing state... [id=0d58568e-ee45-ffa7-ce04-f1f5cc1637cd]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=8b30d8c4-85e1-d1c9-b18a-f43795608a00]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-095a8791bedde78b.js"]: Refreshing state... [id=396675ca-1f30-d993-ebe9-c97c2f3fec71]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/RDSyRfeIMtNPUO-uML-2G/_buildManifest.js"]: Refreshing state... [id=7b31a035-935b-7e84-5825-7287f9c1c273]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/index.cache"]: Refreshing state... [id=40a3b6c5-e4ac-ba34-6310-b5acd8b44adf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/500.cache"]: Refreshing state... [id=c4c71d16-90c8-c6b4-f657-5d3fcfd96e7b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/sitemap.xml.cache"]: Refreshing state... [id=65bfe4ea-e200-7d8b-6621-a3dcbea7843a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-71b6fc99672c83d6.js"]: Refreshing state... [id=e5b733d6-4647-1696-c8c6-b470fd2515c0]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/_not-found.cache"]: Refreshing state... [id=6fc398c9-ce7f-d098-2858-392698914eb8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/2eeaa02267ae05a4.css"]: Refreshing state... [id=d53b2b03-50fc-268b-bc75-31068c325b1e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-4007705705dbde3d.js"]: Refreshing state... [id=5e5e3e29-d3e6-a563-dca9-fd8f2a5d781a]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/favicon.ico.cache"]: Refreshing state... [id=52116f0f-b5c4-9d30-6605-003338d27e19]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"]: Refreshing state... [id=431c59dc-b990-f5cf-efc4-d2777821eb00]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/9d4aa2bb10d1d993.css"]: Refreshing state... [id=b1d255f7-1fe7-67be-6085-37a0f528d327]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-6eedea7c280ebbc1.js"]: Refreshing state... [id=3092d8ac-7976-4b46-ed81-7d49618a24eb]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/icon.svg.cache"]: Refreshing state... [id=27326959-166d-0ec7-066a-98066ce80d7a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/apple-icon.png.cache"]: Refreshing state... [id=dd2ca0f4-bbdc-df02-8219-81d9a7b0d608]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/cgv.cache"]: Refreshing state... [id=e294638e-ccea-9737-e607-1feac3a78a4c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1852367c91c26582.js"]: Refreshing state... [id=9572b7d9-d12a-8a49-1db6-5a6476060cce]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/RDSyRfeIMtNPUO-uML-2G/_ssgManifest.js"]: Refreshing state... [id=2aeb2f7b-9306-0abc-898b-d19428507e35]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=69a9a8bb-42a9-7c68-f6e2-5b66f2783a7b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=5beed671-49e3-2fc9-f37e-ba7456b5bf65]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=8b71e3a0828e7ac6573e001ebe1d72530107cce5]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=83a2d24c-728f-55ef-5dad-a439237a64c2]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2dc562e8-ebb8-2078-2a5f-b3258614d62e" -> null
      - triggers_replace = [
          - "nextjs",
          - "16432531a5cffd1c08785bbc5e8717e4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c015793a-8405-a58e-c8d4-8d26fb4bb8e3" -> null
      - triggers_replace = [
          - "nextjs",
          - "7cc2f88dcae72cba4e391d48e0431c6a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "679cc3bf-2eb5-19fa-4288-05cbf77d5d9b" -> null
      - triggers_replace = [
          - "nextjs",
          - "21aea01471fcaf96a53620c6301cd144",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/page"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2bdd2071-9e84-e201-3f0d-d2ef3f1d5f3f" -> null
      - triggers_replace = [
          - "nextjs",
          - "62e84590791dd84a94b32df84aeb854a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "0d58568e-ee45-ffa7-ce04-f1f5cc1637cd" -> null
      - triggers_replace = [
          - "nextjs",
          - "06671add60c788d155f63c9aa9fd6bb3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "804a9de1-3d35-3ec4-9798-f275bce01136" -> null
      - triggers_replace = [
          - "nextjs",
          - "6efba96dde8579c3a2b78280c3f69bd5",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "301dd035-1212-6fb8-63f5-7229d19e6451" -> null
      - triggers_replace = [
          - "nextjs",
          - "26364a4d087635dfcb1e161eb6f18686",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9d2c7797-18ab-8d1c-8bd1-0c5f6a2fa9e5" -> null
      - triggers_replace = [
          - "nextjs",
          - "5d8b48a29f1dcacaa2a5e124f58b1410",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "66f9d611-d066-c2ea-d6f0-e0c583ca6be0" -> null
      - triggers_replace = [
          - "nextjs",
          - "d09b66e95f76ef0f76eb29ecc65088fe",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/page"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ac1c5bba-0dc6-fb26-b3c0-026b17cf854b" -> null
      - triggers_replace = [
          - "nextjs",
          - "c892e8d18272b105c248f5874efba067",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "dc4dbab8-3a40-53d1-8e3a-4677284a3706" -> null
      - triggers_replace = [
          - "nextjs",
          - "5c6ceaf4b02cccf9f623bafbb1357279",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "361a1835-ef74-37d0-ca2f-1d2bb19afe73" -> null
      - triggers_replace = [
          - "nextjs",
          - "1b2d7c4beccf9aeb83a9886658a4f054",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c3ca0778-5f25-2bf6-d312-d0602a4e031d" -> null
      - triggers_replace = [
          - "nextjs",
          - "02b5c93539016f44908113660f38bfc2",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "98a04343-0931-ce3a-6db8-e107ea4063dc" -> null
      - triggers_replace = [
          - "nextjs",
          - "348c5ace462392d67d64a79c773ced44",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "82420f34-fe13-569d-bd62-089a2263389a" -> null
      - triggers_replace = [
          - "nextjs",
          - "002bc301d8368442c3f428b9f18e04cc",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d8c15149-9b2f-0e43-fb52-70d6343b5dcf" -> null
      - triggers_replace = [
          - "nextjs",
          - "611d2242bba1be72c1452fc6556598f8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/_not-found"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "34c96e66-d1e3-caf2-398e-d5f536851c32" -> null
      - triggers_replace = [
          - "nextjs",
          - "43fcfcb4f117c096217c188bb65495e5",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/apple-icon.png"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c11f346f-faa2-09bf-bfb1-beacad683be4" -> null
      - triggers_replace = [
          - "nextjs",
          - "473e91b7f27404dec0d00431788b7baf",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/cgv"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "447a9869-e324-9f23-89c1-1e518b270519" -> null
      - triggers_replace = [
          - "nextjs",
          - "d08b610d5d4ad54a794b3a6dc3298cc1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/favicon.ico"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b5903b48-4711-fb3b-b0a9-a8d77015e82e" -> null
      - triggers_replace = [
          - "nextjs",
          - "15e1b7bc62773d2e591d2414c56255fb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/icon.svg"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fe5c1b44-4be9-7fa2-2401-524eb0378701" -> null
      - triggers_replace = [
          - "nextjs",
          - "485250f0e3e09380e155d87052b5198d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/index"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "55da65c7-9525-3869-c00c-080345870d19" -> null
      - triggers_replace = [
          - "nextjs",
          - "60b68eb7ad8725d2a1b7b63751eaa292",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/sitemap.xml"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/layout-RDSyRfeIMtNPUO-uML-2G/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "134b97b9-378f-c828-81c7-db56ced60b34" -> null
      - triggers_replace = [
          - "nextjs",
          - "5b91a5f5abd50d64e90d73efd6025825",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/page"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ea6b5a95-5e85-5cd4-d68e-fbfe2af5a102" -> null
      - triggers_replace = [
          - "nextjs",
          - "57c627f62fb80875f800e0a5c3b50a64",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "151a2cc5-86bd-fb0b-e1b3-1d156158ac04" -> null
      - triggers_replace = [
          - "nextjs",
          - "c30bc1ba0e9320632ad7ca7e45512885",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "89af22b2-c5d2-781f-818b-a6e3035d5e90" -> null
      - triggers_replace = [
          - "nextjs",
          - "6526490f5e3a68f6582209e7ecca0844",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9cb2ed65-1edc-129f-c315-92db9e52aa10" -> null
      - triggers_replace = [
          - "nextjs",
          - "ec64726d845db1f0ae82a83dee6db8da",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "00e2caab050a1bd14a9e8493d4371bc4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "9c6f0d9c9807b43784e31a2137d86d1b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5988b950517c9765e55e69afca965a00",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b458cd252f53111b65f32a904ac9e9d4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a912ec2faaf7ac765f472c968b0f0d6d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5aee9dd19a9239b31d8e356ab555e0f1",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b0283e418aa8d203975e92b7f65996b7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "51dc69d71f163e9aa48816a952b54d71",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "06de51eb7739b59414c0b12698a3b3b2",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5da9c8ba32e53548e10ca1b550bc4fc9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bfd0f6615a11f84eca0be6540d530f7d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6532e900285e25158b3ab59ee4e836c2",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "eb8117a0d7b5389803420d8de747058b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f1d3002743650ebf4283b8d32d3c95a7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "20bc2def1f69f93a3b0b1b79028c837e",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "16c29bd3a5c0ec9b695c2ce12ba27c7d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "dc7293466080c82796ef08683061d296",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a6bab096bdebebb675b7fb3d7572d256",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "39a9c14539e424c450f4afce34635074",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "805956f52830ac23001b8ea963ad5bbc",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0633247da3e6a9d5dd052dc19f5533f8",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e34a363fdb78b32a17d5b6b137defa09",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/layout-iGRn1jroYxzFEevS61H7i/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "deae1ee32d9f8639152aa61dee22c3fa",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e00c91d6344f280428a32d0177038e0e",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "cdac4ef615515c2b8112761b1ec9ce6a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "42083ed8df19208d8afcafc83cfe098f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iGRn1jroYxzFEevS61H7i/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "632a39e79a65216f18dd997752f4acde",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-17T15:03:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:12/invocations" -> (known after apply)
      ~ source_code_hash               = "6hT9MjTAZvSUf55gHA1NaVHOvTffCKOzjF5fNeCOvBk=" -> "Z7OCfWcnJGNT/yKAUFwlklw9QkLplkSY1nL6WOxPMow="
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "5beed671-49e3-2fc9-f37e-ba7456b5bf65" -> (known after apply)
      ~ triggers_replace = [
          ~ "12" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-17T15:03:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:12/invocations" -> (known after apply)
      ~ source_code_hash               = "+Gb6Q+VW4VZXVKBqAOORtGdaOAV432uH8h4gwMMgCiA=" -> "b73WsjISO4cR+EFoWKGuhsIFMb0RNGZE3EJDwjbQM8M="
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "8b30d8c4-85e1-d1c9-b18a-f43795608a00" -> (known after apply)
      ~ triggers_replace = [
          ~ "12" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "69a9a8bb-42a9-7c68-f6e2-5b66f2783a7b" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "5b797acb9d5135d786357f4ba96dfcb0" -> "e6068346403655a1691bf07418102067",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/500.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "c4c71d16-90c8-c6b4-f657-5d3fcfd96e7b" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "d86b24430358094d827e98c4584efdf0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/_not-found.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "6fc398c9-ce7f-d098-2858-392698914eb8" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "ffe275b116c99122bfda166768ad04b2",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/apple-icon.png.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "dd2ca0f4-bbdc-df02-8219-81d9a7b0d608" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/cgv.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e294638e-ccea-9737-e607-1feac3a78a4c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "3f89997d88279cfd50f60adf7a036126",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/favicon.ico.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "52116f0f-b5c4-9d30-6605-003338d27e19" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/icon.svg.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "27326959-166d-0ec7-066a-98066ce80d7a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/index.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "40a3b6c5-e4ac-ba34-6310-b5acd8b44adf" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "2100da3724bf9e6fd411f55d346b6859",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["RDSyRfeIMtNPUO-uML-2G/sitemap.xml.cache"] will be destroyed
  # (because key ["RDSyRfeIMtNPUO-uML-2G/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "65bfe4ea-e200-7d8b-6621-a3dcbea7843a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "f95f5d22b3d7384f11b99a3665e4800d",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/RDSyRfeIMtNPUO-uML-2G/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/RDSyRfeIMtNPUO-uML-2G/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "7b31a035-935b-7e84-5825-7287f9c1c273" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/RDSyRfeIMtNPUO-uML-2G/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/RDSyRfeIMtNPUO-uML-2G/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "2aeb2f7b-9306-0abc-898b-d19428507e35" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-095a8791bedde78b.js"] will be destroyed
  # (because key ["_next/static/chunks/4bd1b696-095a8791bedde78b.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "396675ca-1f30-d993-ebe9-c97c2f3fec71" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "01ea7c199ecaf4b41e4bb3722f40ef51",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "01ea7c199ecaf4b41e4bb3722f40ef51",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-4007705705dbde3d.js"] will be destroyed
  # (because key ["_next/static/chunks/517-4007705705dbde3d.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "5e5e3e29-d3e6-a563-dca9-fd8f2a5d781a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "af329f2997a3595ccfaa778e4ae0e1e3",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "af329f2997a3595ccfaa778e4ae0e1e3",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/996-e9920ed25e1eda96.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "c489fff6908dd111292c0cd9043a4560",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"] will be destroyed
  # (because key ["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "431c59dc-b990-f5cf-efc4-d2777821eb00" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "11428d238858bca6b3edb53af90a013f",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "11428d238858bca6b3edb53af90a013f",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-205faefd79dfe52a.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b275d01f8c24dbe044dfb30f1213f66e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-71b6fc99672c83d6.js"] will be destroyed
  # (because key ["_next/static/chunks/app/layout-71b6fc99672c83d6.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e5b733d6-4647-1696-c8c6-b470fd2515c0" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "baa6fe251de8ed9798fd8c8931e26568",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-6eedea7c280ebbc1.js"] will be destroyed
  # (because key ["_next/static/chunks/app/page-6eedea7c280ebbc1.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "3092d8ac-7976-4b46-ed81-7d49618a24eb" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "87785197fc47d02374ae0a2c454e0380",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-95872ad84d81ceb3.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "ce7f451bfdba0bb662c7a9435afd756b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1852367c91c26582.js"] will be destroyed
  # (because key ["_next/static/chunks/webpack-1852367c91c26582.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "9572b7d9-d12a-8a49-1db6-5a6476060cce" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "8641eab1e323a7d755e508c94ecfa07c",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-b0a5578123d5a084.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "6de7ba19443136ef10f0fbdd785ffe6a",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/2eeaa02267ae05a4.css"] will be destroyed
  # (because key ["_next/static/css/2eeaa02267ae05a4.css"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d53b2b03-50fc-268b-bc75-31068c325b1e" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a2fdf37ef6deab0b60b6244048b0e96",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/5a47010bd655ea80.css"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "d9e5357a86cbf540a74eb013fb07025d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/71eae52e2cb595a8.css"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1fbe0a880ff3c54de88edd17f2fee8a4",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/9d4aa2bb10d1d993.css"] will be destroyed
  # (because key ["_next/static/css/9d4aa2bb10d1d993.css"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "b1d255f7-1fe7-67be-6085-37a0f528d327" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "670780e58785b8df12143d006ebe78bd",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/iGRn1jroYxzFEevS61H7i/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/iGRn1jroYxzFEevS61H7i/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f82562d762bcdd6598f770019e21c5ff",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "024d4e038bf490150d9d5d9bc67cdd7e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "3e931d66c622f621e55ee3028de1978e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "4ca200c791883c41ef2d61d6fda215e8",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "7aa55436b40dd56ab33eed8ffdcf6b70",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iGRn1jroYxzFEevS61H7i/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "a8864b6ac727e43bd843dfb8ac02fd26",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-17T15:03:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:12/invocations" -> (known after apply)
      ~ source_code_hash               = "Ahr6aRU36NKrwhFmvvQU32Dtw6wgq2BtkeBQZFNXJBA=" -> "T8BMsv0BnJCgVmxEMnhXM1JkLmkjuu1c1oUWfyjb4GA="
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "83a2d24c-728f-55ef-5dad-a439237a64c2" -> (known after apply)
      ~ triggers_replace = [
          ~ "12" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 51 to add, 3 to change, 49 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @victorlevasseur, Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*